MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx675f512h.h
extern volatile __DCH4CONbits_t DCH4CONbits __asm__ ("DCH4CON") __attribute__((section("sfrs"), address(0xBF883360)));
extern volatile uint32_t        DCH4CONCLR __attribute__((section("sfrs"),address(0xBF883364)));
extern volatile uint32_t        DCH4CONSET __attribute__((section("sfrs"),address(0xBF883368)));
extern volatile uint32_t        DCH4CONINV __attribute__((section("sfrs"),address(0xBF88336C)));
#define DCH4ECON DCH4ECON
extern volatile uint32_t   DCH4ECON __attribute__((section("sfrs"), address(0xBF883370)));
typedef union {
  struct {
    uint32_t :3;
    uint32_t AIRQEN:1;
    uint32_t SIRQEN:1;
    uint32_t PATEN:1;
    uint32_t CABORT:1;
    uint32_t CFORCE:1;
    uint32_t CHSIRQ:8;
    uint32_t CHAIRQ:8;
  };
  struct {
    uint32_t w:32;
  };
} __DCH4ECONbits_t;
extern volatile __DCH4ECONbits_t DCH4ECONbits __asm__ ("DCH4ECON") __attribute__((section("sfrs"), address(0xBF883370)));
extern volatile uint32_t        DCH4ECONCLR __attribute__((section("sfrs"),address(0xBF883374)));
extern volatile uint32_t        DCH4ECONSET __attribute__((section("sfrs"),address(0xBF883378)));
extern volatile uint32_t        DCH4ECONINV __attribute__((section("sfrs"),address(0xBF88337C)));
#define DCH4INT DCH4INT
extern volatile uint32_t   DCH4INT __attribute__((section("sfrs"), address(0xBF883380)));
typedef union {
  struct {
    uint32_t CHERIF:1;
    uint32_t CHTAIF:1;
    uint32_t CHCCIF:1;
    uint32_t CHBCIF:1;
    uint32_t CHDHIF:1;
    uint32_t CHDDIF:1;
    uint32_t CHSHIF:1;
    uint32_t CHSDIF:1;
    uint32_t :8;
    uint32_t CHERIE:1;
    uint32_t CHTAIE:1;
    uint32_t CHCCIE:1;
    uint32_t CHBCIE:1;
    uint32_t CHDHIE:1;
    uint32_t CHDDIE:1;
    uint32_t CHSHIE:1;
    uint32_t CHSDIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __DCH4INTbits_t;
extern volatile __DCH4INTbits_t DCH4INTbits __asm__ ("DCH4INT") __attribute__((section("sfrs"), address(0xBF883380)));
extern volatile uint32_t        DCH4INTCLR __attribute__((section("sfrs"),address(0xBF883384)));
extern volatile uint32_t        DCH4INTSET __attribute__((section("sfrs"),address(0xBF883388)));
extern volatile uint32_t        DCH4INTINV __attribute__((section("sfrs"),address(0xBF88338C)));
#define DCH4SSA DCH4SSA
extern volatile uint32_t   DCH4SSA __attribute__((section("sfrs"), address(0xBF883390)));
typedef struct {
  uint32_t CHSSA:32;
} __DCH4SSAbits_t;
extern volatile __DCH4SSAbits_t DCH4SSAbits __asm__ ("DCH4SSA") __attribute__((section("sfrs"), address(0xBF883390)));
extern volatile uint32_t        DCH4SSACLR __attribute__((section("sfrs"),address(0xBF883394)));
extern volatile uint32_t        DCH4SSASET __attribute__((section("sfrs"),address(0xBF883398)));
extern volatile uint32_t        DCH4SSAINV __attribute__((section("sfrs"),address(0xBF88339C)));
#define DCH4DSA DCH4DSA
extern volatile uint32_t   DCH4DSA __attribute__((section("sfrs"), address(0xBF8833A0)));
typedef struct {
  uint32_t CHDSA:32;
} __DCH4DSAbits_t;
extern volatile __DCH4DSAbits_t DCH4DSAbits __asm__ ("DCH4DSA") __attribute__((section("sfrs"), address(0xBF8833A0)));
extern volatile uint32_t        DCH4DSACLR __attribute__((section("sfrs"),address(0xBF8833A4)));
extern volatile uint32_t        DCH4DSASET __attribute__((section("sfrs"),address(0xBF8833A8)));
extern volatile uint32_t        DCH4DSAINV __attribute__((section("sfrs"),address(0xBF8833AC)));
#define DCH4SSIZ DCH4SSIZ
extern volatile uint32_t   DCH4SSIZ __attribute__((section("sfrs"), address(0xBF8833B0)));
extern volatile uint32_t        DCH4SSIZCLR __attribute__((section("sfrs"),address(0xBF8833B4)));
extern volatile uint32_t        DCH4SSIZSET __attribute__((section("sfrs"),address(0xBF8833B8)));
extern volatile uint32_t        DCH4SSIZINV __attribute__((section("sfrs"),address(0xBF8833BC)));
#define DCH4DSIZ DCH4DSIZ
extern volatile uint32_t   DCH4DSIZ __attribute__((section("sfrs"), address(0xBF8833C0)));
extern volatile uint32_t        DCH4DSIZCLR __attribute__((section("sfrs"),address(0xBF8833C4)));
extern volatile uint32_t        DCH4DSIZSET __attribute__((section("sfrs"),address(0xBF8833C8)));
extern volatile uint32_t        DCH4DSIZINV __attribute__((section("sfrs"),address(0xBF8833CC)));
#define DCH4SPTR DCH4SPTR
extern volatile uint32_t   DCH4SPTR __attribute__((section("sfrs"), address(0xBF8833D0)));
extern volatile uint32_t        DCH4SPTRCLR __attribute__((section("sfrs"),address(0xBF8833D4)));
extern volatile uint32_t        DCH4SPTRSET __attribute__((section("sfrs"),address(0xBF8833D8)));
extern volatile uint32_t        DCH4SPTRINV __attribute__((section("sfrs"),address(0xBF8833DC)));
#define DCH4DPTR DCH4DPTR
extern volatile uint32_t   DCH4DPTR __attribute__((section("sfrs"), address(0xBF8833E0)));
extern volatile uint32_t        DCH4DPTRCLR __attribute__((section("sfrs"),address(0xBF8833E4)));
extern volatile uint32_t        DCH4DPTRSET __attribute__((section("sfrs"),address(0xBF8833E8)));
extern volatile uint32_t        DCH4DPTRINV __attribute__((section("sfrs"),address(0xBF8833EC)));
#define DCH4CSIZ DCH4CSIZ
extern volatile uint32_t   DCH4CSIZ __attribute__((section("sfrs"), address(0xBF8833F0)));
extern volatile uint32_t        DCH4CSIZCLR __attribute__((section("sfrs"),address(0xBF8833F4)));
extern volatile uint32_t        DCH4CSIZSET __attribute__((section("sfrs"),address(0xBF8833F8)));
extern volatile uint32_t        DCH4CSIZINV __attribute__((section("sfrs"),address(0xBF8833FC)));
#define DCH4CPTR DCH4CPTR
extern volatile uint32_t   DCH4CPTR __attribute__((section("sfrs"), address(0xBF883400)));
extern volatile uint32_t        DCH4CPTRCLR __attribute__((section("sfrs"),address(0xBF883404)));
extern volatile uint32_t        DCH4CPTRSET __attribute__((section("sfrs"),address(0xBF883408)));
extern volatile uint32_t        DCH4CPTRINV __attribute__((section("sfrs"),address(0xBF88340C)));
#define DCH4DAT DCH4DAT
extern volatile uint32_t   DCH4DAT __attribute__((section("sfrs"), address(0xBF883410)));
extern volatile uint32_t        DCH4DATCLR __attribute__((section("sfrs"),address(0xBF883414)));
extern volatile uint32_t        DCH4DATSET __attribute__((section("sfrs"),address(0xBF883418)));
extern volatile uint32_t        DCH4DATINV __attribute__((section("sfrs"),address(0xBF88341C)));
#define DCH5CON DCH5CON
extern volatile uint32_t   DCH5CON __attribute__((section("sfrs"), address(0xBF883420)));
typedef union {
  struct {
    uint32_t CHPRI:2;
    uint32_t CHEDET:1;
    uint32_t :1;
    uint32_t CHAEN:1;
    uint32_t CHCHN:1;
    uint32_t CHAED:1;
    uint32_t CHEN:1;
    uint32_t CHCHNS:1;
    uint32_t :6;
    uint32_t CHBUSY:1;
  };
  struct {
    uint32_t w:32;
  };
} __DCH5CONbits_t;
